/**
 * @param preferences - an array of integers. Indices of people, whom they love
 * @returns number of love triangles
 */
/*
function getLoveTrianglesCount(preferences = []) {
  var n=0;                                            // число треугольных треугольников
   var corner2, corner3                               // номера 2 и 3 углов
  for (var i=0;i<(preferences.length);i++){         // i-номер первого из трех треугольников
        corner2=preferences[i]-1;
           // console.log("corner2=",corner2);
    corner3=preferences[corner2]-1;
           // console.log("corner3=",corner3);
              // console.log("pass",i);
    if ((preferences[corner3]-1)==i)
      n++;
  }
  return n/3;
  }
  console.log(getLoveTrianglesCount([145, 153, 193, 262, 97, 76, 138, 72, 293, 108, 102, 80, 261, 253, 218, 141, 49, 257, 135, 16, 122, 6, 55, 47, 44, 274, 136, 176, 104, 177, 267, 146, 295, 196, 103, 290, 181, 273, 18, 248, 178, 272, 63, 192, 284, 266, 211, 45, 83, 14, 105, 148, 186, 157, 159, 149, 19, 66, 40, 215, 119, 118, 37, 199, 246, 197, 240, 53, 166, 244, 230, 107, 123, 220, 165, 22, 218, 281, 96, 110, 297, 255, 17, 137, 301, 251, 187, 150, 71, 28, 161, 172, 296, 300, 27, 264, 249, 286, 288, 36, 292, 188, 182, 289, 258, 56, 8, 221, 223, 12, 115, 224, 169, 42, 174, 283, 74, 120, 216, 62, 93, 142, 147, 116, 213, 175, 277, 33, 133, 54, 113, 1, 227, 144, 57, 95, 298, 140, 32, 7, 20, 21, 75, 265, 132, 139, 73, 158, 106, 190, 280, 228, 156, 223, 235, 260, 130, 52, 23, 179, 252, 191, 31, 234, 143, 241, 94, 162, 131, 259, 214, 185, 155, 270, 226, 90, 247, 281, 271, 204, 63, 35, 222, 170, 92, 68, 189, 11, 87, 88, 168, 25, 238, 212, 46, 233, 58, 236, 242, 4, 82, 70, 67, 217, 85, 152, 60, 291, 119, 183, 24, 299, 294, 225, 207, 209, 180, 243, 13, 117, 10, 210, 269, 239, 171, 126, 129, 206, 131, 89, 26, 151, 34, 285, 173, 275, 98, 3, 112, 203, 69, 64, 77, 202, 250, 276, 30, 59, 5, 268, 9, 91, 50, 81, 201, 99, 39, 51, 184, 153, 219, 200, 208, 79, 134, 195, 163, 245, 109, 115, 160, 114, 279, 231, 198, 65, 287, 101, 38, 232, 41, 18, 124, 48, 164, 237, 127, 256, 29, 100, 263, 278, 251, 125, 128, 121, 254, 84, 194, 167, 205]));
*/

module.exports = function getLoveTrianglesCount(preferences = []) {
  var n=0;                                            // число треугольных треугольников
   var corner2, corner3;                              // номера 2 и 3 углов
  for (var i=0;i<(preferences.length1);i++){          // i-номер первого из трех треугольников
    corner2=preferences[i]-1;
    corner3=preferences[corner2]-1;
    if ((preferences[corner3]-1)==i)
      n++;
  }
  return n/3;
};




